<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6c30070185b37613b24b40f467cd90e54991a929a911f8d664d49245947909f2","plan_job_ref":"Job Terraform Plan #10 at https://github.com/thetheilred/test-eks/actions/runs/13099224420","plan_out_hash":"e9c8e2e29006ef9365f91f21abb55074f8c0b31b5bd96f08476956ec2ff71068","plan_hash":"e25c8f903935154633b3e2b9f5206d996eb5458f7e68ab6b9cc673519ace7bc9","plan_text_format":"diff","version":"1.46.1","closed":true} -->
Terraform plan in __terraform/eks__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_eks_cluster.example will be created
+   resource "aws_eks_cluster" "example" {
+       arn                           = (known after apply)
+       bootstrap_self_managed_addons = true
+       certificate_authority         = (known after apply)
+       cluster_id                    = (known after apply)
+       created_at                    = (known after apply)
+       endpoint                      = (known after apply)
+       id                            = (known after apply)
+       identity                      = (known after apply)
+       name                          = "example"
+       platform_version              = (known after apply)
+       role_arn                      = "arn:aws:iam::730335642042:role/eks-cluster-example"
+       status                        = (known after apply)
+       tags_all                      = (known after apply)
+       version                       = "1.31"

+       access_config {
+           authentication_mode = "API"
        }

+       kubernetes_network_config (known after apply)

+       upgrade_policy (known after apply)

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = false
+           endpoint_public_access    = true
+           public_access_cidrs       = (known after apply)
+           subnet_ids                = [
+               "arn:aws:ec2:us-east-1:730335642042:subnet/subnet-05e6d85d1c0e679e1",
+               "arn:aws:ec2:us-east-1:730335642042:subnet/subnet-067506e073b3485f2",
+               "arn:aws:ec2:us-east-1:730335642042:subnet/subnet-0df63a1fd283987d4",
            ]
+           vpc_id                    = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #3](https://github.com/thetheilred/test-eks/actions/runs/13099233523)